LeeNX/ESP32-BLE-Gamepad/BleGamepad.cpp
void BleGamepad::setGyroscope(int16_t gX, int16_t gY, int16_t gZ)
{
  if (gX == -32768)
  {
    gX = -32767;
  }
  
  if (gY == -32768)
  {
    gY = -32767;
  }
  
  if (gY == -32768)
  {
    gY = -32767;
  }
  
  _gX = gX;
  _gY = gY;
  _gZ = gZ; 
  
  if (configuration.getAutoReport())
  {
    sendReport();
  }
}

void BleGamepad::setAccelerometer(int16_t aX, int16_t aY, int16_t aZ)
{
  _aX = aX;
  _aY = aY;
  _aZ = aZ;
  
  if (configuration.getAutoReport())
  {
    sendReport();
  }
}

void BleGamepad::setMotionControls(int16_t gX, int16_t gY, int16_t gZ, int16_t aX, int16_t aY, int16_t aZ)
{
  if (gX == -32768)
  {
    gX = -32767;
  }
  
  if (gY == -32768)
  {
    gY = -32767;
  }
  
  if (gZ == -32768)
  {
    gZ = -32767;
  }
  
  if (aX == -32768)
  {
    aX = -32767;
  }
  
  if (aY == -32768)
  {
    aY = -32767;
  }
  
  if (aZ == -32768)
  {
    aZ = -32767;
  }
  
  _gX = gX;
  _gY = gY;
  _gZ = gZ;
  _aX = aX;
  _aY = aY;
  _aZ = aZ; 
  
  if (configuration.getAutoReport())
  {
    sendReport();
  }
}
    
void BleGamepad::setPowerStateAll(uint8_t batteryPowerInformation, uint8_t dischargingState, uint8_t chargingState, uint8_t powerLevel)
{
    uint8_t powerStateBits = 0b00000000;
    
    _batteryPowerInformation = batteryPowerInformation;
    _dischargingState = dischargingState;
    _chargingState = chargingState;
    _powerLevel = powerLevel;

    // HID Battery Power State Bits:
    // Bits 0 and 1: Battery Power Information : 0(0b00) = Unknown, 1(0b01) = Not Supported,  2(0b10) = Not Present,               3(0b11) = Present
    // Bits 2 and 3: Discharging State         : 0(0b00) = Unknown, 1(0b01) = Not Supported,  2(0b10) = Not Discharging,           3(0b11) = Discharging
    // Bits 4 and 5: Charging State            : 0(0b00) = Unknown, 1(0b01) = Not Chargeable, 2(0b10) = Not Charging (Chargeable), 3(0b11) = Charging (Chargeable)
    // Bits 6 and 7: Power Level               : 0(0b00) = Unknown, 1(0b01) = Not Supported,  2(0b10) = Good Level,                3(0b11) = Critically Low Level

    powerStateBits |= (_batteryPowerInformation << 0);  // Populate first 2 bits with data
    powerStateBits |= (_dischargingState        << 2);  // Populate second 2 bits with data
    powerStateBits |= (_chargingState           << 4);  // Populate third 2 bits with data
    powerStateBits |= (_powerLevel              << 6);  // Populate last 2 bits with data

    if (this->pCharacteristic_Power_State) 
    {
      this->pCharacteristic_Power_State->setValue(&powerStateBits, 1);
      this->pCharacteristic_Power_State->notify();
    }
}


void BleGamepad::setBatteryPowerInformation(uint8_t batteryPowerInformation)
{
  _batteryPowerInformation = batteryPowerInformation;
  setPowerStateAll(_batteryPowerInformation, _dischargingState, _chargingState, _powerLevel);
}

void BleGamepad::setDischargingState(uint8_t dischargingState)
{
  _dischargingState = dischargingState;
  setPowerStateAll(_batteryPowerInformation, _dischargingState, _chargingState, _powerLevel);
}

void BleGamepad::setChargingState(uint8_t chargingState)
{
  _chargingState = chargingState;
  setPowerStateAll(_batteryPowerInformation, _dischargingState, _chargingState, _powerLevel);
}

void BleGamepad::setPowerLevel(uint8_t powerLevel)
{
  _powerLevel = powerLevel;
  setPowerStateAll(_batteryPowerInformation, _dischargingState, _chargingState, _powerLevel);
}

// Simplified power state (GAMEPAD_POWER_STATE_UNKNOWN / _CHARGING / _ON_BATTERY / _FULL), independent of the
// detailed GATT Battery Power State characteristic above. Feeds the optional HID report field and advertising
// manufacturer data.
void BleGamepad::setPowerState(uint8_t state)
{
  _reportPowerState = state;

  if (configuration.getAutoReport())
  {
    sendReport();
  }

  if (configuration.getEnableManufacturerData())
  {
    // Legacy advertising is paused entirely while a client is connected, so there's nothing to push
    // live right now - just stage the data (no host call). It'll go out the moment advertising
    // resumes on disconnect: NimBLEAdvertising::start() (called automatically via
    // advertiseOnDisconnect(true)) pushes m_advData live whenever a staged update marked it dirty.
    updateManufacturerData(!this->isConnected());
  }
}

// pushLive selects how the updated data reaches the BLE stack:
//  - false: stage the data only (no direct host call) - used for the very first update, made from
//    taskServer() before the initial pAdvertising->start(). The BLE host is not guaranteed to have
//    finished syncing with the controller at that point, so - just like the existing setName()/
//    setAppearance()/addServiceUUID() calls right above it - this only mutates the local advertising
//    data and lets start() push everything live once the host is confirmed ready.
//  - true: push the data live via a direct host call - used for every later update from
//    setBatteryLevel()/setPowerState(), called after begin() has returned, by which point the host
//    has long since synced (advertising has already started at least once).
void BleGamepad::updateManufacturerData(bool pushLive)
{
  if (this->pAdvertising == nullptr)
  {
    #if BLE_GAMEPAD_DEBUG == 1
      if (Serial) Serial.println("[BLEGamepad][DEBUG] updateManufacturerData - Skipped: pAdvertising not ready yet");
    #endif
    return;
  }

  // Rate-limit the actual over-the-air push. Battery/power state don't need to change every time
  // setBatteryLevel()/setPowerState() happens to be called (e.g. a sketch polling an ADC every
  // second) - each live push is a real HCI command to the radio, so throttle it to
  // getManufacturerDataUpdateInterval() (default 5s, configurable, 0 = no throttling). This only
  // gates the broadcast: GATT/HID values from setBatteryLevel()/setPowerState() are unaffected and
  // stay real-time.
  if (pushLive)
  {
    uint32_t interval = configuration.getManufacturerDataUpdateInterval();
    if (interval > 0 && (millis() - _lastManufacturerDataPushMs) < interval)
    {
      #if BLE_GAMEPAD_DEBUG == 1
        if (Serial)
        {
          Serial.printf("[BLEGamepad][DEBUG] updateManufacturerData - Throttled: last live push was %lums ago, interval=%lums\n",
                        (unsigned long)(millis() - _lastManufacturerDataPushMs), (unsigned long)interval);
        }
      #endif
      return;
    }
  }

