LeeNX/ESP32-BLE-Gamepad/BleGamepad.cpp
  uint16_t companyId = configuration.getManufacturerCompanyId();

  uint8_t clampedBattery = (this->batteryLevel > 100) ? 100 : this->batteryLevel;
  uint8_t scaledBattery = (clampedBattery * 31) / 100; // 0-100 scaled down to 5 bits (0-31, ~3.2% steps)
  uint8_t powerState = this->_reportPowerState & 0x03; // 2 bits (0-3)

  // Bit-pack power state + battery into a single byte to keep the advertising payload as small as
  // possible: bits 7-6 = power state, bits 5-1 = scaled battery level, bit 0 reserved.
  uint8_t packedState = (powerState << 6) | (scaledBattery << 1);

  uint8_t manufacturerData[3];
  manufacturerData[0] = lowByte(companyId);
  manufacturerData[1] = highByte(companyId);
  manufacturerData[2] = packedState;

  // Work on a copy of the current advertisement data and strip any manufacturer data field this
  // function previously added. NimBLE's setManufacturerData() only appends - it never replaces a
  // stale field - so calling it directly on every battery/power update would grow the payload
  // without bound and eventually overflow the advertising packet.
  NimBLEAdvertisementData advData = this->pAdvertising->getAdvertisementData();
  advData.removeData(BLE_ADV_MANUFACTURER_DATA_AD_TYPE);

  size_t baseSize = advData.getPayload().size();
  size_t neededSize = baseSize + 2 + sizeof(manufacturerData);

  #if BLE_GAMEPAD_DEBUG == 1
    if (Serial)
    {
      Serial.printf("[BLEGamepad][DEBUG] updateManufacturerData - pushLive=%d companyId=0x%04X battery=%u(scaled=%u) powerState=%u packed=0x%02X baseAdvSize=%u neededSize=%u limit=%u\n",
                    pushLive, companyId, this->batteryLevel, scaledBattery, powerState, packedState, (unsigned)baseSize, (unsigned)neededSize, (unsigned)BLE_ADV_MAX_PAYLOAD_SIZE);
    }
  #endif

  // Guard against the rest of the advertisement (name, appearance, service UUID, etc.) already
  // leaving no room for the manufacturer data field (2 header bytes + payload).
  if (neededSize > BLE_ADV_MAX_PAYLOAD_SIZE)
  {
    NIMBLE_LOGW(LOG_TAG, "updateManufacturerData - Skipped: advertising packet has no room left for manufacturer data (device name/services too long)");
    #if BLE_GAMEPAD_DEBUG == 1
      if (Serial) Serial.println("[BLEGamepad][DEBUG] updateManufacturerData - Skipped: not enough room in advertising packet");
    #endif
    return;
  }

  if (pushLive)
  {
    advData.setManufacturerData(manufacturerData, sizeof(manufacturerData));
    bool ok = this->pAdvertising->setAdvertisementData(advData);
    _lastManufacturerDataPushMs = millis();
    #if BLE_GAMEPAD_DEBUG == 1
      if (Serial) Serial.printf("[BLEGamepad][DEBUG] updateManufacturerData - setAdvertisementData (live) result=%d payload=%s\n", ok, advData.toString().c_str());
    #endif
  }
  else
  {
    bool ok = this->pAdvertising->setManufacturerData(manufacturerData, sizeof(manufacturerData));
    #if BLE_GAMEPAD_DEBUG == 1
      if (Serial) Serial.printf("[BLEGamepad][DEBUG] updateManufacturerData - setManufacturerData (staged) result=%d\n", ok);
    #endif
  }
}

#if BLE_GAMEPAD_DEBUG == 1
static void dumpHidReportDescriptor(const uint8_t* desc, size_t size) {
    if (!Serial) {
        // Serial not initialized yet, avoid printing
        return;
    }

    if (desc == nullptr || size == 0) {
        Serial.println("[BLEGamepad][ERROR] HID Report Descriptor is null or empty!");
        return;
    }

    Serial.printf("[BLEGamepad][INFO] HID Report Descriptor size: %u bytes\n", (unsigned)size);
    for (size_t i = 0; i < size; i++) {
        if (i % 16 == 0) {
            Serial.printf("\n%03u: ", (unsigned)i);
        }
        Serial.printf("%02X ", desc[i]);
    }
    Serial.println("\n[BLEGamepad][INFO] End of HID Report Descriptor");

    Serial.printf("\n\nCopy start under here\n");
    for (size_t i = 0; i < size; i++) {
        if (i % 16 == 0) {
            Serial.printf("\n");
        }
        Serial.printf("%02X ", desc[i]);
    }
    Serial.println("\nCopy end above here ");
    Serial.println("\n\nCopy and paste the output above and use a parser such as at https://eleccelerator.com/usbdescreqparser to create a readable HID Report Descriptor\n\n");
}

static void dumpHIDReport(const uint8_t* report, size_t size)
{
    if (!Serial) {
        // Serial not initialized yet, avoid printing
        return;
    }

    Serial.printf("[BLEGamepad][INFO] HID Report Dump size: %u bytes\n", (unsigned)size);
    for (size_t i = 0; i < size; i++)
    {
        Serial.printf("%02X ", report[i]);
        // Optional: break line every 16 bytes
        if ((i + 1) % 16 == 0) Serial.println();
    }
    Serial.println();
    Serial.println("\n[BLEGamepad][INFO] End of HID Report Dump");
}
#endif

void BleGamepad::beginNUS() 
{
    if (!this->nusInitialized) 
    {
        // Extrememly important to make sure that the pointer to server is actually valid
        while(!NimBLEDevice::isInitialized ()){}        // Wait until the server is initialized
        while(NimBLEDevice::getServer() == nullptr){}   // Ensure pointer to server is actually valid
        
        // Now server is nkown to be valid, initialise nus to new BleNUS instance
        nus = new BleNUS(NimBLEDevice::getServer()); // Pass the existing BLE server
        nus->begin();
        nusInitialized = true;
    }
}

BleNUS* BleGamepad::getNUS() 
{
    return nus;  // Return a pointer instead of a reference
}

void BleGamepad::sendDataOverNUS(const uint8_t* data, size_t length) 
{
  if (nus) 
  {
    nus->sendData(data, length);
  }
}

void BleGamepad::setNUSDataReceivedCallback(void (*callback)(const uint8_t* data, size_t length)) 
{
  if (nus) 
  {
    nus->setDataReceivedCallback(callback);
  }
}

void BleGamepad::taskServer(void *pvParameter)
{
  BleGamepad *BleGamepadInstance = (BleGamepad *)pvParameter; // static_cast<BleGamepad *>(pvParameter);

  NimBLEDevice::init(BleGamepadInstance->deviceName);
  NimBLEDevice::setPower(BleGamepadInstance->configuration.getTXPowerLevel()); // Set transmit power for advertising (Range: -12 to +9 dBm)
  NimBLEServer *pServer = NimBLEDevice::createServer();
  pServer->setCallbacks(BleGamepadInstance->connectionStatus);
  pServer->advertiseOnDisconnect(true);

